bit-finance/Reports/бит_ПроизвольныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_ПроизвольныйОтчет</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НастройкиПроизвольныхОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматЧисел</Name>
					<Comment>Формат чисел</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборВОтчете</Name>
					<Comment>Отбор в отчете</Comment>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Comment>Режим расшифровки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Comment>Язык</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Языки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтандартныйПериод</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПримечания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаПараметры</Name>
					<Comment>Таблица параметры</Comment>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаДанныеОтчета</Name>
					<Comment>Таблица данные отчета</Comment>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта отчета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс отчета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Comment>Кратность отчета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПулаПодключений</Name>
					<Comment>Настройка пула подключений</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_НастройкиПуловПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбластиРасшифровки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

bit-finance/Reports/бит_ПроизвольныйОтчет/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
#Область СлужебныйПрограммныйИнтерфейс

Функция НовыеСохраняемыеНастройки() Экспорт

	СохраняемыеНастройки = Новый Структура;
	
	ИсключаемыеРеквизиты = Новый Структура;
	ИсключаемыеРеквизиты.Вставить("ТаблицаДанныеОтчета");
	ИсключаемыеРеквизиты.Вставить("СтандартныйПериод");
	
	РеквизитыОбъекта = Метаданные.Отчеты.бит_ПроизвольныйОтчет.Реквизиты;
	Для Каждого Реквизит Из РеквизитыОбъекта Цикл
		Если ИсключаемыеРеквизиты.Свойство(Реквизит.Имя) Тогда
			Продолжить;
		КонецЕсли; 
		СохраняемыеНастройки.Вставить(Реквизит.Имя);
	КонецЦикла;
	
	СохраняемыеНастройки.Вставить("ОтборВОтчете",
		Новый ХранилищеЗначения(Новый ТаблицаЗначений, Новый СжатиеДанных(9))); 
	СохраняемыеНастройки.Вставить("ТаблицаПараметры",
		Новый ХранилищеЗначения(Новый ТаблицаЗначений, Новый СжатиеДанных(9)));
	СохраняемыеНастройки.Вставить("ВариантПериода", ВариантСтандартногоПериода.ЭтотГод);
	
	Возврат СохраняемыеНастройки;
	
КонецФункции

Функция НовыеПараметрыФормированияОтчета() Экспорт

	НовыеПараметры = Новый Структура;
	НовыеПараметры.Вставить("НастройкаОтчета", 			Неопределено);
	НовыеПараметры.Вставить("ДатаНачала", 				'0001-01-01');
	НовыеПараметры.Вставить("ДатаОкончания", 			'0001-01-01');
	НовыеПараметры.Вставить("ФорматЧисел", 				"");
	НовыеПараметры.Вставить("ОтборВОтчете", 			Новый ТаблицаЗначений);
	НовыеПараметры.Вставить("Язык", 					Неопределено);
	НовыеПараметры.Вставить("Организация", 				Неопределено);
	НовыеПараметры.Вставить("УдалитьПримечания", 		Ложь);
	НовыеПараметры.Вставить("ТаблицаПараметры", 		Новый ТаблицаЗначений);
	НовыеПараметры.Вставить("ТаблицаДанныеОтчета", 		Новый ТаблицаЗначений);
	НовыеПараметры.Вставить("ВалютаДокумента", 			Неопределено);
	НовыеПараметры.Вставить("КурсДокумента", 			0);
	НовыеПараметры.Вставить("КратностьДокумента", 		0);
	НовыеПараметры.Вставить("НастройкаПулаПодключений", Неопределено);
	НовыеПараметры.Вставить("Результат", 				Новый ТабличныйДокумент());
	НовыеПараметры.Вставить("ИмяОбласти", 				"");
	
	Возврат НовыеПараметры;
	
КонецФункции

Функция РезультатФормированияОтчета(ПараметрыЗаполнения) Экспорт
	
	бит_МеханизмПолученияДанных.СформироватьПроизвольныйОтчет(ПараметрыЗаполнения,
		ПараметрыЗаполнения.Результат, ПараметрыЗаполнения.ОтборВОтчете, ПараметрыЗаполнения.ТаблицаПараметры, 
		ПараметрыЗаполнения.ТаблицаДанныеОтчета, ПараметрыЗаполнения.НастройкаПулаПодключений);
		
	Если ПараметрыЗаполнения.УдалитьПримечания Тогда
		УдалениеПримечания(ПараметрыЗаполнения.Результат);
	КонецЕсли;	
		
	РезультатФормирования = Новый Структура("Результат, ДанныеОтчета", 
								ПараметрыЗаполнения.Результат, ПараметрыЗаполнения.ТаблицаДанныеОтчета);
	
	Возврат РезультатФормирования;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УдалениеПримечания(ДокументРезультат)
	
	Для каждого Область Из ДокументРезультат.Области Цикл
		Область.Примечание.Текст = "";
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
